<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.1.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Karabiner-Elements and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.tim-fitzgerald.munki.Karabiner-Elements</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>karabinerelements</string>
		<key>pkginfo</key>
		<dict>
			<key>blocking_applications</key>
			<array>
				<string>Karabiner-EventViewer.app</string>
				<string>Karabiner-Menu.app</string>
				<string>Karabiner-Elements.app</string>
				<string>Karabiner-NotificationWindow.app</string>
				<string>Autoupdate.app</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>production</string>
			</array>
			<key>category</key>
			<string>Productivity</string>
			<key>description</key>
			<string>Karabiner-Elements is the subset of the next generation Karabiner for macOS Sierra.</string>
			<key>developer</key>
			<string>Fumihiko Takayama</string>
			<key>display_name</key>
			<string>Karabiner-Elements</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.tim-fitzgerald.download.Karabiner-Elements</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
